INSERT INTO BookTable (book_name, book_category, book_author)
VALUES ('Война и мир', 'Роман', 'Лев Толстой'),
       ('Преступление и наказание', 'Роман', 'Фёдор Достоевский'),
       ('Мастер и Маргарита', 'Фантастика', 'Михаил Булгаков'),
       ('Три мушкетёра', 'Роман', 'Александр Дюма'),
       ('Гарри Поттер и философский камень', 'Фэнтези', 'Дж. К. Роулинг'),
       ('Алхимик', 'Философский роман', 'Пауло Коэльо'),
       ('1984', 'Антиутопия', 'Джордж Оруэлл'),
       ('Три товарища', 'Роман', 'Эрих Мария Ремарк'),
       ('Пикник на обочине', 'Фантастика', 'Стругацкие'),
       ('Маленький принц', 'Сказка', 'Антуан де Сент-Экзюпери');



INSERT INTO ReaderTable (reader_name, reader_phone, reader_address, reader_email)
VALUES ('Алексей Иванов', '+998901112233', 'г. Ташкент, ул. Навои, 12', 'alexey.ivanov@example.com'),
       ('Мария Петрова', '+998933445566', 'г. Самарканд, ул. Регистан, 8', 'maria.petrova@example.com'),
       ('Дмитрий Смирнов', '+998907778899', 'г. Бухара, ул. Ибн Сина, 21', 'dmitriy.smirnov@example.com'),
       ('Ольга Кузнецова', '+998935551122', 'г. Фергана, ул. Ахмад Фарғоний, 45', 'olga.kuznetsova@example.com'),
       ('Иван Сидоров', '+998907701010', 'г. Наманган, ул. Бабур, 17', 'ivan.sidorov@example.com'),
       ('Наталья Васильева', '+998934443322', 'г. Термез, ул. Амира Темура, 9', 'natalya.vasileva@example.com'),
       ('Егор Николаев', '+998909998877', 'г. Андижан, ул. Бунёдкор, 6', 'egor.nikolaev@example.com'),
       ('Анна Морозова', '+998935005005', 'г. Хива, ул. Ичан-Кала, 3', 'anna.morozova@example.com'),
       ('Павел Фёдоров', '+998907003300', 'г. Навои, ул. Гулистон, 11', 'pavel.fedorov@example.com'),
       ('Ксения Волкова', '+998934009988', 'г. Нукус, ул. Бердақ, 15', 'ksenia.volkova@example.com');

INSERT INTO PersonalTable (per_name, per_phone, per_email)
VALUES ('Елена Попова', '+998901234567', 'elena.popova@example.com'),
       ('Александр Елисеев', '+998933456789', 'alexandr.eliseev@example.com'),
       ('Роман Каримов', '+998907890123', 'roman.karimov@example.com');

INSERT INTO IssueTable (reader_id, book_id, per_id, issue_date, return_date)
VALUES (1, 5, 2, '2025-10-01', '2025-10-15'),
       (2, 3, 1, '2025-10-05', '2025-10-20'),
       (3, 8, 3, '2025-10-07', '2025-10-22'),
       (4, 2, 1, '2025-10-10', '2025-10-25'),
       (5, 7, 2, '2025-10-11', '2025-10-26'),
       (6, 1, 3, '2025-10-13', '2025-10-29'),
       (7, 6, 2, '2025-10-14', '2025-10-30'),
       (8, 4, 1, '2025-10-15', '2025-11-01'),
       (9, 9, 3, '2025-10-17', '2025-11-02'),
       (10, 10, 2, '2025-10-18', '2025-11-05');